import dbConnect from "../../../utils/dbConnect";
import formModel from "../../../models/form";
import categoryModel from "../../../models/category";

export default async function apiHandler(req, res) {
  const { method } = req;
  if (!(await sessionChecker(req, "form")))
    return res
      .status(403)
      .json({ success: false, message: "Access Forbidden" });

  await dbConnect();

  switch (method) {
    case "GET":
      try {
        const { categoryId } = req.query;

        if (!categoryId) {
          return res
            .status(400)
            .json({ success: false, message: "categoryId is required" });
        }

        // 카테고리 아이디로 폼 데이터 조회
        const data = await formModel.find({ categoryId });

        res.status(200).json({ success: true, form: data });
      } catch (err) {
        console.log(err);
        res.status(400).json({ success: false });
      }
      break;

    case "POST":
      try {
        const formFields = {
          소재: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "주방용품",
            "귀금속/보석/시계류",
            "영유아용품",
            "악기",
            "스포츠용품",
          ],
          "색상(선택지)": [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "휴대폰",
            "영유아용품",
            "악기",
            "스포츠용품",
          ],
          "크기(선택지)": [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
          ],
          크기: [
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
          ],
          제조자: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "주방용품",
            "화장품",
            "귀금속/보석/시계류",
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
            "영유아용품",
            "악기",
            "스포츠용품",
            "기타 재화",
          ],
          제조국: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "주방용품",
            "화장품",
            "귀금속/보석/시계류",
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
            "영유아용품",
            "악기",
            "스포츠용품",
            "기타 재화",
          ],
          주의사항: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "화장품",
            "귀금속/보석/시계류",
            "가공식품",
            "건강기능식품",
            "영유아용품",
          ],
          제조연월: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "주방용품",
            "식품 (농수산물)",
            "가공식품",
            "영유아용품",
            "악기",
            "스포츠용품",
          ],
          품질보증기준: [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "주방용품",
            "화장품",
            "귀금속/보석/시계류",
            "영유아용품",
            "악기",
            "스포츠용품",
          ],
          "A/S 책임자와 연락처": [
            "구두/신발",
            "의류",
            "가방",
            "패션잡화 (모자/벨트/액세서리)",
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "의료기기",
            "주방용품",
            "화장품",
            "귀금속/보석/시계류",
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
            "영유아용품",
            "악기",
            "스포츠용품",
            "상품권/쿠폰",
            "모바일 쿠폰",
            "영화/공연",
            "기타 용역",
            "기타 재화",
          ],
          종류: ["가방", "패션잡화 (모자/벨트/액세서리)"],
          구성: [
            "침구류/커튼",
            "가구 (침대/소파/싱크대/DIY제품)",
            "주방용품",
            "식품 (농수산물)",
            "악기",
            "스포츠용품",
            "서적",
          ],
          "KC 인증정보": [
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "자동차용품 (자동차부품/기타 자동차용품)",
            "영유아용품",
            "스포츠용품",
          ],
          "배송 · 설치비용": [
            "가구 (침대/소파/싱크대/DIY제품)",
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
          ],
          "정격전압, 소비 전력": [
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "소형전자 (MP3/전자사전 등)",
            "내비게이션",
            "의료기기",
          ],
          "에너지 소비 효율 등급": [
            "영상가전 (TV류)",
            "가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)",
            "계절가전 (에어컨/온풍기)",
            "사무용기기 (컴퓨터/노트북/프린터)",
          ],
          사양: [
            "영상가전 (TV류)",
            "사무용기기 (컴퓨터/노트북/프린터)",
            "광학기기 (디지털카메라/캠코더)",
            "소형전자 (MP3/전자사전 등)",
            "휴대폰",
            "내비게이션",
            "화장품",
            "귀금속/보석/시계류",
            "악기",
            "스포츠용품",
          ],
          "냉난방 면적": ["계절가전 (에어컨/온풍기)"],
          "이동통신 가입조건": ["휴대폰"],
          "맵 업데이트 비용 및 무상기간": ["내비게이션"],
          적용차종: ["자동차용품 (자동차부품/기타 자동차용품)"],
          "검사합격증 번호": ["자동차용품 (자동차부품/기타 자동차용품)"],
          "허가·인증·신고번호": ["의료기기"],
          사용방법: ["의료기기", "화장품"],
          "수입식품안전관리특별법 관련 문구": ["주방용품"],
          중량: [
            "화장품",
            "귀금속/보석/시계류",
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
          ],
          사용기한: [
            "화장품",
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
            "상품권/쿠폰",
            "모바일 쿠폰",
          ],
          성분: ["화장품"],
          "기능성 화장품 여부": ["화장품"],
          "보증서 제공 여부": ["귀금속/보석/시계류"],
          "유전자변형농수산물 여부 / 지리적 표시 여부": [
            "식품 (농수산물)",
            "가공식품",
            "건강기능식품",
          ],
          "등급 표시 / 이력관리대상 여부": ["식품 (농수산물)"],
          "수입식품 여부": ["식품 (농수산물)", "가공식품", "건강기능식품"],
          "보관방법 또는 취급방법": ["식품 (농수산물)"],
          유형: ["가공식품"],
          "원재료명 및 함량": ["가공식품", "건강기능식품"],
          영양성분: ["가공식품", "건강기능식품"],
          기능정보: ["건강기능식품"],
          "부작용 가능성": ["건강기능식품"],
          "질병 치료용 의약품 아님 문구": ["건강기능식품"],
          "섭취 주의사항": ["건강기능식품"],
          사용연령: ["영유아용품"],
          "크기, 체중의 한계": ["영유아용품"],
          "저자,출판사": ["서적"],
          쪽수: ["서적"],
          발행일: ["서적"],
          "목차 또는 책소개": ["서적"],
          발행자: ["상품권/쿠폰", "모바일 쿠폰"],
          "이용 가능 매장": ["상품권/쿠폰", "모바일 쿠폰"],
          "잔액 환급 조건": ["상품권/쿠폰"],
          "환불조건 및 방법": ["모바일 쿠폰", "영화/공연", "기타 용역"],
          "주최 또는 기획": ["영화/공연"],
          주연: ["영화/공연"],
          관람등급: ["영화/공연"],
          "상영, 공연시간": ["영화/공연"],
          "상영, 공연장소": ["영화/공연"],
          "예매 취소 조건": ["영화/공연"],
          "서비스 제공 사업자": ["기타 용역"],
          "법에 의한 인증·허가 사항": ["기타 용역", "기타 재화"],
          이용조건: ["기타 용역"],
        };

        // 모든 라벨과 값을 순회
        for (const [label, values] of Object.entries(formFields)) {
          for (const value of values) {
            // 카테고리 이름으로 카테고리 조회
            const category = await categoryModel.findOne({ name: value });
            if (!category) {
              continue;
            }

            const formData = {
              categoryId: category._id,
              label,
              type: "text",
            };

            await formModel.create(formData);
          }
        }

        res.status(200).json({ success: true });
      } catch (err) {
        console.log(err);
        res.status(400).json({ success: false });
      }
      break;

    default:
      res.status(400).json({ success: false });
      break;
  }
}
